test/nexj/core/persistence/sql/data/readGroupByExpr.xml

<nv:Envelope xmlns:nv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xs="http://www.w3.org/2001/XMLSchema">
   <nv:Body xmlns:ns="http://www.nexjsystems.com/xml-soap" nv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
      <ns:Array>
         <items nc:arrayType="xs:anyType[4]">
            <Item href="#a"/>
            <Item href="#b"/>
            <Item href="#c"/>
            <Item href="#d"/>
         </items>
      </ns:Array>
      <ns:TransferObject id="a">
         <class>Object</class>
         <version>0</version>
         <keys nc:arrayType="xs:string[1]">
            <Item>fnl</Item>
         </keys>
         <values nc:arrayType="xs:anyType[1]">
            <Item xi:type="xs:int">3</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="b">
         <class>Object</class>
         <version>0</version>
         <keys nc:arrayType="xs:string[1]">
            <Item>fnl</Item>
         </keys>
         <values nc:arrayType="xs:anyType[1]">
            <Item xi:type="xs:int">4</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="c">
         <class>Object</class>
         <version>0</version>
         <keys nc:arrayType="xs:string[1]">
            <Item>fnl</Item>
         </keys>
         <values nc:arrayType="xs:anyType[1]">
            <Item xi:type="xs:int">5</Item>
         </values>
      </ns:TransferObject>
      <ns:TransferObject id="d">
         <class>Object</class>
         <version>0</version>
         <keys nc:arrayType="xs:string[1]">
            <Item>fnl</Item>
         </keys>
         <values nc:arrayType="xs:anyType[1]">
            <Item xi:type="xs:int">6</Item>
         </values>
      </ns:TransferObject>
   </nv:Body>
</nv:Envelope>
